Tutorials-3.0.0/waveTube/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    sphere
    {
        type            oscillatingDisplacement;
        amplitude	(0.005 0 0);
        omega		1000; //T=1/2*pi*omega
        value    	uniform (0.005 0 0);
    }
    
    "(frontAndBack|topAndBottom)"
    {
        type            empty;
    }
    
    free
    {
        type            uniformFixedValue;
        uniformValue    constant ( 0 0 0);
    }
}

// ************************************************************************* //
